$(document).ready( function() {
	
	
	

    $("#form1").validate({

//#################################################--Define as regras--########################################################
        rules:{

            data_saida:{

                // O campo cargo será obrigatório (required) e terá tamanho mínimo (minLength)

                required: true

            },
			

//-----------------------------------------------------------------------------------------------------------------------------			
			
			            n_contrato:{

                // O campo cargo será obrigatório (required) e terá tamanho mínimo (minLength)

                required: true

            },
			
			
			
//-----------------------------------------------------------------------------------------------------------------------------			
			
			            unidade:{

                // O campo cargo será obrigatório (required) e terá tamanho mínimo (minLength)

                required: true

            },
			
			

//-----------------------------------------------------------------------------------------------------------------------------


            descricao2:{

                // O campo unidade será  obrigatório

                required: true, minlength: 10
				

            }

        },

//-------------------------------------------------------Fim das Regras---------------------------------------------------

//######################################--Define as mensagens de erro para cada regra--#######################################
        

        messages:{

            data_saida:{

                required: "Entre com a data de saída!"


            },
			
//-----------------------------------------------------------------------------------------------------------------------------	

            n_contrato:{

                required: "Entre com a empresa!"


            },	
			
			
			
			
//-----------------------------------------------------------------------------------------------------------------------------	

            unidade:{

                required: "Entre com a Unidade!"


            },
			
			
			


			
//-----------------------------------------------------------------------------------------------------------------------------	

            descricao2:{

                required: "Digite a descrição",

                minlength: "deve conter, no mínimo, 10 caracteres"

             

            }
			
//-----------------------------------------------------------------------------------------------------------------------------		
			
			
			
			
			

        }

    });

});