$(document).ready( function() {
	
$("#form1").validate({

//#################################################--Define as regras--########################################################
        rules:{

            empresa:{

                // O campo cargo será obrigatório (required) e terá tamanho mínimo (minLength)

                 required: true, minlength: 3

            },
			
			
			
			
//-----------------------------------------------------------------------------------------------------------------------------

            cod_estados:{

                // O campo estado será obrigatório

                required: true

            },			
			
			
			
//-----------------------------------------------------------------------------------------------------------------------------

            cod_cidades:{

                // O campo Cidade será obrigatório

                required: true

            },			
			
			
			
			
//-----------------------------------------------------------------------------------------------------------------------------

            Bairro:{

                // O campo Bairro será obrigatório

                required: true

            },			
			
			
			
			
			
//-----------------------------------------------------------------------------------------------------------------------------

            Numero:{

                // O campo Numero será obrigatório

                required: true

            },			
			
			
			
			
			
			
//-----------------------------------------------------------------------------------------------------------------------------

            email:{

                // O campo Email será obrigatório

                required: true, email: true

            },			
			
			
			
			
			
			
//=======================================================================================================================================================

            CNPJ:{

                // O campo cargo será obrigatório (required) e terá tamanho mínimo (minLength)

                 required: true, minlength: 20

            },
			
			
			//=======================================================================================================================================================
			
			
			
            CEP:{

                // O campo cargo será obrigatório (required) e terá tamanho mínimo (minLength)

                required: true, minlength: 10

            },
			
			
//=======================================================================================================================================================
			
			
			
            Telefone:{

                // O campo cargo será obrigatório (required) e terá tamanho mínimo (minLength)

                required: true, minlength: 14

            },
			
			
			
//=======================================================================================================================================================
			
			
			
            Preposto:{

                // O campo cargo será obrigatório (required) e terá tamanho mínimo (minLength)

                required: true, minlength: 3

            },
			
			
			
//=======================================================================================================================================================
			
			
			
            Razao_Social:{

                // O campo cargo será obrigatório (required) e terá tamanho mínimo (minLength)

                required: true, minlength: 3

            },
			
			
			
//=======================================================================================================================================================
			
			
			
            Cidade:{

                // O campo cargo será obrigatório (required) e terá tamanho mínimo (minLength)

                required: true

            },
			
			
			
			//=======================================================================================================================================================
			
			
			
            Endereco:{

                // O campo cargo será obrigatório (required) e terá tamanho mínimo (minLength)

                required: true, minlength: 3

            },
			
			
			
//=======================================================================================================================================================

            estado:{

                // O campo unidade será  obrigatório

                required: true
				

            }

        },

//-------------------------------------------------------Fim das Regras---------------------------------------------------

//######################################--Define as mensagens de erro para cada regra--#######################################
        

        messages:{

            empresa:{

                required: "Entre com o nome da empresa!",
				minlength: "Entre com um nome Válido!"


            },
			
			
			
			
//-----------------------------------------------------------------------------------------------------------------------------	

            
Bairro:{

                required: "Digite o Bairro"

                

            },			
			
			
			
			
			
			
//-----------------------------------------------------------------------------------------------------------------------------	

            
Numero:{

                required: "Digite o número"

               

            },			
			
			
			
			
			
			
			//-----------------------------------------------------------------------------------------------------------------------------	

            
email:{

                required: "Entre com o email",
                
				email: "Digite um e-mail válido"


            },			
			
			
			

//-----------------------------------------------------------------------------------------------------------------------------	



       

            CNPJ:{

                required: "Entre com o CNPJ!",
				 minlength: "Digite apenas números, 18 caracteres"


            },
			
			
//-----------------------------------------------------------------------------------------------------------------------------	



       

            CEP:{

                required: "Entre com o CEP!",
				minlength: "Digite apenas números, 10 caracteres"


            },
			
			
//-----------------------------------------------------------------------------------------------------------------------------	



       

            Telefone:{

                required: "Entre com o Telefone!",
				 minlength: "Digite apenas números, 10 caracteres"


            },
			
			
//-----------------------------------------------------------------------------------------------------------------------------	



       

            Preposto:{

                required: "Entre com o nome do Preposto!",
				minlength: "Entre com um nome Válido!"


            },
			
//-----------------------------------------------------------------------------------------------------------------------------	



       

            Razao_Social:{

                required: "Entre com a Razao Social!",
				minlength: "Entre com um nome Válido!"


            },
			
			
			
//-----------------------------------------------------------------------------------------------------------------------------	

            
cod_cidades:{

                required: "Escolha um estado para carregar as cidades"

                

            },
			
			
//-----------------------------------------------------------------------------------------------------------------------------	

            Endereco:{

                required: "Entre com o enderço!",
				minlength: "Digite um enderço válido"


            },																			
			
			
//-----------------------------------------------------------------------------------------------------------------------------	

            
cod_estados:{

                required: "Escolha o estado"

                

            }
			
//-----------------------------------------------------------------------------------------------------------------------------		
			
			
			
			
			

        }

    });

});